from notebook_functions import*

if __name__ == '__main__':
    # Словник з користувацьким інтерфейсом
    user_interface_dict = {
        'add': '- додати нотатку',
        'earliest': '- виводить збережені нотатки у хронологічному порядку від найранішої до найпізнішої',
        'latest': '- виводить збережені нотатки у хронологічному порядку від найпізнішої до найранішої',
        'longest': '- виводить збережені нотатки у порядку їх довжини від найдовшої до найкоротшої',
        'shortest': '- виводить збережені нотатки у порядку їх довжини від найкоротшої до найдовшої',
        'clear': '- очистити нотатник',
        'exit': '- зберегти та вийти з нотатника'
    }

    # Вивід привітання, пояснення
    print('Програма, для введення та перегляду нотаток.')
    print('--------------------------------------------')

    # Відкриваємо наш файл та зчитуємо його в список text_file_lst
    with open('text_file.txt', mode='r', encoding='utf-8') as tf:
        text_file_lst = tf.readlines()

    tuple_keys = show_user_interface(user_interface_dict)  # Змінна для ключів словника

    # Передаємо кортеж в функцію у вигляді аргументів для порівняння
    # та список з нотатками
    get_user_choice(tuple_keys, text_file_lst)
