print("""Программа читає текстовий файл та використовуює тільки list comprehension і ніякі інше цикли,
розділяє текст на лінії (строки) методом readlines() та створює список.""")

if __name__ == '__main__':
    # Відкриваємо та зчитуємо файл построково в список
    with open('file.txt', mode='r', encoding='utf-8') as f:
        lst = f.readlines()

    # Проходимо по списку lst
    # добавляэмо елемент в новий список, якщо там присутня маленька літера "а",
    # якщо відсутня добавляємо в новий список пусту строку ''
    # в добавленого елемента вирізаємо строку до літери 'а'
    # робимо елемент з великої літери
    my_list = [elem.strip()[elem.find('a'):].capitalize() if 'a' in elem else '' for elem in lst]
    print()
    print(f'Вихідний список: {my_list}')
