# Варіант з використанням циклу для підведення суми чисел в списку
print('Програма приймає числа та виводить їх суму. Для виведення суми введіть слово - "sum".')
text_input = input('Ваше число:').lower()
my_list = list()  # Список для зберігання вхідних данних(елементів)
suma = 0  # Змінна для зберігання суми чисел

# Даємо користувачу вводити все що він захоче до слова "sum"
# Пробуємо елемент списку  my_list перетворити в флоат(число) та додати до змінної suma
# якщо не виходить(точніше помилка) то пропускаємо елемент
while text_input != 'sum':
    my_list.append(text_input)
    text_input = input('Ваше число: ')
else:
    for elem in my_list:
        try:
            suma += float(elem)
        except Exception:
            continue

    print(f'Сума введених чисел = {suma}')
