# Варіант з використанням функції sum() та списків
print('Програма приймає числа та виводить їх суму. Для виведення суми введіть слово - "sum".')
text_input = input('Ваше число:').lower()
my_list = list()  # Список для зберігання вхідних данних(елементів)

# Поки користувач не введе слово "sum" зациклюємо запит на ввод числа
# Якщо користувач ввів якийсь символ чи не зрозуміле слово ---> Отримує повідомлення
# В іншому випадку додаємо елемент вводу до списку my_list
# Даємо користувачу знову виконати ввод
while text_input != 'sum':
    if text_input.isalpha() or not text_input.isdigit():
        print('Введіть число або sum, будь-ласка!')
    else:
        my_list.append(float(text_input))

    text_input = input('Ваше число: ').lower()
else:
    print(f'Сума введених чисел = {round(sum(my_list),2)}')
