# Варіант без використання списків
print('Програма приймає числа та виводить їх суму. Для виведення суми введіть слово - "sum".')
text_input = input('Ваше число:').lower()
suma = 0  # Змінна для зберігання суми чисел

# Зациклюємо поки користувач не введе слово sum, інакше виводимо суму чисел
# Пробуємо до змінної suma добавити те що  ввів користувач
# якщо перетворити не можливо, повідомляємо користувача, щоб ввів коректне значення
# Даємо користувачу знову виконати ввод
while text_input != 'sum':
    try:
        suma += float(text_input)
    except Exception:
        print('Введіть число або sum, будь-ласка!')

    text_input = input('Ваше число:').lower()

else:
    print(f'Сума введених чисел = {suma}')
