# Програма приймає текст та визначає яке слово найчастіше зустрічається (краще робити зі знанням списків)
print('Програма приймає текст та визначає яке слово найчастіше зустрічається')
text = input('Введіть текст\n>> ').lower().split()

count = 0  # Лічильник кількості повторень слова
word = ''  # Змінна для збереження слова, яке найчастіше повторюється
# Перебираєм елементи списку
# якщо кількість повторень елементу більше лічильника(count)
# Лічильнику присвоюєм значення кількості повторень елементу
# в змінну word зберігаєм значення елементу списка
for elem in text:
    if text.count(elem) > count:
        count = text.count(elem)
        word = elem

print(f'Найчастіше зустрічається слово -> {word}')
