# Програма приймає текст та шукає найдовше слово (краще робити зі знанням списків)
print('Програма приймає текст та шукає найдовше слово.')
text = input('Введіть Ваш текст\n>>> ').split()  # Ввод тексту та розбиття його на елементи списку

maximum = 0  # Початкове значення максимальної довжини
long = ''  # Змінна що зберігатиме найдовше слово

# Проходимо по кожному елементу списка та перевіряємо його довжину
# якщо довжина елементу списка більша за (maximum)початкове значення максимальної довжини
# maximum присвоюємо значення довжини елементу списка
# long присвоюємо значення елемента списка
for elem in text:
    if len(elem) > maximum:
        maximum = len(elem)
        long = elem

print(f'Найдовше слово це - {long}')
